# Merging

In [1]:
# import libraries
import pandas as pd
import numpy as np

In [2]:
# Example datasets for data merging
data1 = {
    'id': [1, 2, 3],
    'name': ['Ahmed', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}
df1 = pd.DataFrame(data1)
df1.head()

   id    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [3]:
data2 = {
    'id': [1, 2, 3],
    'city': ['Karachi', 'Lahore', 'Islamabad'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}
df2 = pd.DataFrame(data2)
df2.head()

   id       city occupation
0   1    Karachi   Engineer
1   2     Lahore     Doctor
2   3  Islamabad    Teacher

In [11]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df.head()

   id    name  age       city occupation
0   1   Ahmed   28    Karachi   Engineer
1   2  Fatima   32     Lahore     Doctor
2   3     Ali   24  Islamabad    Teacher

In [12]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df1, df2, on='id', how='right')
merged_df.head()

   id    name  age       city occupation
0   1   Ahmed   28    Karachi   Engineer
1   2  Fatima   32     Lahore     Doctor
2   3     Ali   24  Islamabad    Teacher

In [17]:
data1 = {
    'id': [1, 2, 3],
    'name': ['Ahmed', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}
df3 = pd.DataFrame(data1)
df3.head()

   id    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [18]:
data2 = {
    'id': [1, 2, 3, 4, 5],
    'city': ['Karachi', 'Lahore', 'Islamabad', 'Quetta', 'Peshawar'],
    'occupation': ['Engineer', 'Doctor', 'Teacher', 'Businessman', 'Pilot']
}
df4 = pd.DataFrame(data2)
df4.head()

   id       city   occupation
0   1    Karachi     Engineer
1   2     Lahore       Doctor
2   3  Islamabad      Teacher
3   4     Quetta  Businessman
4   5   Peshawar        Pilot

In [22]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df3, df4, on='id', how='outer')
merged_df.head()

   id    name   age       city   occupation
0   1   Ahmed  28.0    Karachi     Engineer
1   2  Fatima  32.0     Lahore       Doctor
2   3     Ali  24.0  Islamabad      Teacher
3   4     NaN   NaN     Quetta  Businessman
4   5     NaN   NaN   Peshawar        Pilot

# Concatenation

In [25]:
# Dataset 1 - Pakistani Names and Ages
data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}
# Dataset 2 - More Pakistani Names and Ages
data2 = {'Name': ['Sara', 'Usman', 'Aisha'], 'Age': [29, 35, 27]}
# Dataset 3 - Cities and Provinces in Pakistan
data3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'Islamabad']}
df1 = pd.DataFrame(data1)
print(df1.head())
df2 = pd.DataFrame(data2)
print(df2.head())
df3 = pd.DataFrame(data3)
print(df3.head())

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
    Name  Age
0   Sara   29
1  Usman   35
2  Aisha   27
        City   Province
0    Karachi      Sindh
1     Lahore     Punjab
2  Islamabad  Islamabad

In [29]:
# Concatenating Rows
concatenated_rows = pd.concat([df1, df2])
df4= concatenated_rows
print(df4)

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27

In [30]:
# Concatenating Columns
concatenated_columns = pd.concat([df4, df3], axis=1)
print(concatenated_columns)

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad
0    Sara   29    Karachi      Sindh
1   Usman   35     Lahore     Punjab
2   Aisha   27  Islamabad  Islamabad